Revit 2027 API
LogicalOrFilter(ElementFilter, ElementFilter) Constructor
 Constructs a new instance of the logical filter with two input filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LogicalOrFilter(
	ElementFilter filter1,
	ElementFilter filter2
)
Public Sub New (
	filter1 As ElementFilter,
	filter2 As ElementFilter
)
public:
LogicalOrFilter(
	ElementFilter^ filter1,
	ElementFilter^ filter2
)
new :
        filter1 : ElementFilter *
        filter2 : ElementFilter -> LogicalOrFilter
Parameters
filter1 ElementFilter
 The first filter.
filter2 ElementFilter
 The second filter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LogicalOrFilter Class
LogicalOrFilter Overload
Autodesk.Revit.DB Namespace